In [6]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import os
plt.rcParams['figure.figsize'] = [30, 10]

In [7]:
os.chdir('/Users/jeongwookim/Documents/kaggle_data/Predict_Future_Sales')

In [8]:
temp = pd.read_csv('sample_submission.csv')
temp.tail()

            ID  item_cnt_month
214195  214195             0.5
214196  214196             0.5
214197  214197             0.5
214198  214198             0.5
214199  214199             0.5

In [9]:
categories = pd.read_csv('item_categories.csv')
categories.tail()

           item_category_name  item_category_id
79                  Служебные                79
80         Служебные - Билеты                80
81    Чистые носители (шпиль)                81
82  Чистые носители (штучные)                82
83           Элементы питания                83

In [10]:
items = pd.read_csv('items.csv')
items.tail()

,item_name,item_id,item_category_id
22165,"Ядерный титбит 2 [PC, Цифровая версия]",22165,31
22166,Язык запросов 1С:Предприятия [Цифровая версия],22166,54
22167,Язык запросов 1С:Предприятия 8 (+CD). Хрустале...,22167,49
22168,Яйцо для Little Inu,22168,62
22169,Яйцо дракона (Игра престолов),22169,69

In [11]:
shops = pd.read_csv('shops.csv')
shops.tail()

                   shop_name  shop_id
55  Цифровой склад 1С-Онлайн       55
56      Чехов ТРЦ "Карнавал"       56
57   Якутск Орджоникидзе, 56       57
58   Якутск ТЦ "Центральный"       58
59    Ярославль ТЦ "Альтаир"       59

In [18]:
train = pd.read_csv('sales_train.csv')
train['date'] = pd.to_datetime(train['date'])
train.head()

        date  date_block_num  shop_id  item_id  item_price  item_cnt_day
0 2013-02-01               0       59    22154      999.00           1.0
1 2013-03-01               0       25     2552      899.00           1.0
2 2013-05-01               0       25     2552      899.00          -1.0
3 2013-06-01               0       25     2554     1709.05           1.0
4 2013-01-15               0       25     2555     1099.00           1.0

In [34]:
temp = train[(train['date']>'2014-01')&(train['date']<'2014-02')]['shop_id'].unique()

In [35]:
temp.sort()

In [36]:
temp

array([ 2,  3,  4,  5,  6,  7, 10, 12, 13, 14, 15, 16, 17, 18, 19, 21, 22,
       24, 25, 26, 27, 28, 29, 30, 31, 33, 34, 35, 37, 38, 39, 40, 41, 42,
       43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59])

In [32]:
temp2 = train['shop_id'].unique()

In [33]:
temp2.sort()
temp2

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33,
       34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50,
       51, 52, 53, 54, 55, 56, 57, 58, 59])

In [22]:
train.sort_values('date')

              date  date_block_num  shop_id  item_id  item_price  item_cnt_day
109593  2013-01-01               0       46    18616       349.0           1.0
85162   2013-01-01               0       54    11854       199.0           1.0
18128   2013-01-01               0       28     4906      1799.0           1.0
112216  2013-01-01               0       42     2931        99.0           1.0
85141   2013-01-01               0       54    11604       349.0           1.0
...            ...             ...      ...      ...         ...           ...
2915898 2015-12-10              33        6     7390       349.0           1.0
2915896 2015-12-10              33        6     7350       349.0           1.0
2922604 2015-12-10              33       28    10304       199.0           1.0
2915871 2015-12-10              33        6     6798      1849.0           1.0
2898514 2015-12-10              33       58    10207      1199.0           1.0

[2935849 rows x 6 columns]

In [7]:
len(train)

2935849

In [38]:
items.head()

,item_name,item_id,item_category_id
0,! ВО ВЛАСТИ НАВАЖДЕНИЯ (ПЛАСТ.) D,0,40
1,!ABBYY FineReader 12 Professional Edition Full...,1,76
2,***В ЛУЧАХ СЛАВЫ (UNV) D,2,40
3,***ГОЛУБАЯ ВОЛНА (Univ) D,3,40
4,***КОРОБКА (СТЕКЛО) D,4,40

In [41]:
temp = items['item_category_id'].unique()

In [42]:
temp.sort()

In [54]:
train['item_id'] = train['item_id'].apply(lambda x : items['item_category_id'].loc[x])

In [56]:
train=train[['date', 'item_id', 'item_price', 'item_cnt_day']]

In [ ]:
train.columns = ['date', ]